[
  {"title": "Sad News: The founder of /r/jokes has passed away",
  "body": "RIP Larry Tesler, the UI designer that created Cut, Copy and Paste, died age 74"},
  {"title": "Calm down about the Net Neutrality thing...",
  "body": "Paying additional money to access certain sites will give you a sense of pride and accomplishment."},
  {"title": "V",
  "body": "V*Edit: seems like the ctrl key on my keyboard is not working"},
  {"title": "If your surprised that Jeffrey Epstein commited suicide this morning",
  "body": "Imagine how surprised he must have been.Edit: Thank you to the Redditors that awarded this post. To everybody else I’m sorry I typed your instead of you’re."},
  {"title": "A new Navy recruit has his first day on the submarine...",
  "body": "He speaks with the officer, who assigns him his post.Go stand at the periscope entry-way, and make sure no unauthorized personnel touch the periscope.The recruit follows orders, and stands by the periscope. After 15 minutes, the officer stops by.Son I'm changing your post to the mess hall. Go in there and start washing some dishes.The recruit obeys, and heads to the mess hall. He's cleaned about 3 dishes when the officer walks up again.Listen here recruit, your new post is in the supply room. I need you to make sure everything is strapped down tight, in case of rough waters.The recruit again follows orders, and heads off to the supply room. There, he sees a crewman, moving some boxes.Hey there, says the recruit. is it normal to keep getting reassigned to new posts all day? I haven't kept one position for more than 15 minutes!The crewman says Oh yeah- this sub is full of reposts."},
  {"title": "The only two white actors in Black Panther are Martin Freeman, who played Bilbo Baggins, and Andy Serkis who played Gollum.",
  "body": "They're the Tolkien white guys.Edit: Apparently somebody posted this joke to Twitter in October and that makes me a piece of shit.¯_(ツ)_/¯"},
  {"title": "Ajit Pai.",
  "body": "That's it. That's the whole fucking joke.EDIT: Removed edits, people don't like those. [](/rdcry)"},
  {"title": "What did the reddit user say after detonating a bomb inside a bank?",
  "body": "EDIT: Wow! This blew up! Thanks for the gold!"},
  {"title": "The 2016 US Presidential Election",
  "body": "That's it. That's the entire fucking joke."},
  {"title": "Did you hear about the Doctor on the United Flight?",
  "body": "[removed]"},
  {"title": "Everyone in Hawaii is mad about the malfunction of the early warning system. Those fools.",
  "body": "Hawaii **IS** the early warning system."},
  {"title": "If I had a $ for every post I've seen today about Net Neutrality...",
  "body": "I'd have enough money to view a post next year about Net Neutrality."},
  {"title": "Twenty years from now, kids are gonna think Baby it's cold outside is really weird, and we're gonna have to explain that it has to be understood as a product of its time.",
  "body": "You see, it used to get cold outside"},
  {"title": "I hate when people ask how I see myself in 3 years",
  "body": "I don’t have 2020 visionThis is the only day you can upvote thisEDIT: Thank you sm for r/all ! Happy New Years!"},
  {"title": "What’s the difference between a police officer and a bullet?",
  "body": "When a bullet kills someone else, you know it’s been fired"},
  {"title": "If America is storming Area 51 then the Europeans can storm the Vatican",
  "body": "We’ll take the aliens, you get the predators"},
  {"title": "Iris‌‌h daughte‌‌r ha‌‌d no‌‌t bee‌‌n hom‌‌e fo‌‌r ove‌‌r ‌‌5 years‌‌. Upo‌‌n he‌‌r retur‌‌n he‌‌r Fathe‌‌r curse‌‌d he‌‌r heavily‌‌.",
  "body": "Wher‌‌e hav‌‌e y‌‌e bee‌‌n al‌‌l thi‌‌s time‌‌, child‌‌? Wh‌‌y di‌‌d y‌‌e no‌‌t writ‌‌e t‌‌o us‌‌, no‌‌t eve‌‌n ‌‌a line‌‌? Wh‌‌y didn'‌‌t y‌‌e call‌‌? Ca‌‌n y‌‌e no‌‌t understan‌‌d wha‌‌t y‌‌e pu‌‌t ye‌‌r ol‌‌d Mothe‌‌r through?‌‌  ‌‌  Th‌‌e girl‌‌, crying‌‌, replied‌‌, Dad..‌‌. ‌‌I becam‌‌e ‌‌a prostitute.‌‌  ‌‌  Y‌‌e what!‌‌? Ge‌‌t ou‌‌t ‌‌a here‌‌, y‌‌e shameles‌‌s harlot‌‌! Sinner‌‌! You'r‌‌e ‌‌a disgrac‌‌e t‌‌o thi‌‌s Catholi‌‌c family.‌‌  ‌‌  OK‌‌, Dad..‌‌. a‌‌s y‌‌e wish‌‌. ‌‌I onl‌‌y cam‌‌e bac‌‌k t‌‌o giv‌‌e mu‌‌m thi‌‌s luxuriou‌‌s fu‌‌r coat‌‌, titl‌‌e dee‌‌d t‌‌o ‌‌a te‌‌n bedroo‌‌m mansion‌‌, plu‌‌s ‌‌a ‌‌5 millio‌‌n saving‌‌s certificate‌‌. Fo‌‌r m‌‌e littl‌‌e brother‌‌, thi‌‌s gol‌‌d Rolex‌‌. An‌‌d fo‌‌r y‌‌e Daddy‌‌, th‌‌e sparklin‌‌g ne‌‌w Mercede‌‌s limite‌‌d editio‌‌n convertibl‌‌e that'‌‌s parke‌‌d outsid‌‌e plu‌‌s ‌‌a membershi‌‌p t‌‌o th‌‌e countr‌‌y clu‌‌b ..‌‌. (take‌‌s ‌‌a breath‌‌) ..‌‌. an‌‌d a‌‌n invitatio‌‌n fo‌‌r y‌‌e al‌‌l t‌‌o spen‌‌d Ne‌‌w Year'‌‌s Ev‌‌e o‌‌n boar‌‌d m‌‌y ne‌‌w yach‌‌t i‌‌n th‌‌e Riviera.‌‌  ‌‌  Wha‌‌t wa‌‌s i‌‌t y‌‌e sai‌‌d y‌‌e ha‌‌d become?‌‌, say‌‌s Dad‌‌.  ‌‌  Girl‌‌, cryin‌‌g again‌‌, ‌‌A prostitute‌‌, Daddy!‌‌  ‌‌  Oh‌‌! M‌‌y Goodness‌‌! Y‌‌e scare‌‌d m‌‌e hal‌‌f t‌‌o death‌‌, girl‌‌! ‌‌I though‌‌t y‌‌e sai‌‌d ‌‌a Protestant‌‌! Com‌‌e her‌‌e an‌‌d giv‌‌e ye‌‌r ol‌‌d Da‌‌d ‌‌a hug!‌‌"},
  {"title": "This is the dirty joke my 85yo grandad told to our whole family by memory",
  "body": "A male whale and a female whale were swimming off the coast of Japan when they noticed a whaling ship.  The male whale recognized it as the same ship that had harpooned his father many years earlier. He said to the female whale, Lets both swim under the ship and blow out of our air holes at the same time and it should cause the ship to turn over and sink. They tried it and sure enough, the ship turned over and quickly sank. Soon however, the whales realized the sailors had jumped overboard and were swimming to the safety of shore. The male was enraged that they were going to get away and told the female, Let's swim after them and gobble them up before they reach the shore. At this point, he realized the female was becoming reluctant to follow him. Look, she said, I went along with the blow job, but I absolutely refuse to swallow the seamen. Edit: I think it's bad that I'm more excited watching this get ups that I was about the whole of Christmas"},
  {"title": "A Woman goes to buy a Parrot. The prices are $100, $200, and $15. She asks why the last one is so cheap?",
  "body": "Because he used to live in a brothel says the shopkeeper. She pays $15.When she gets home the parrot says: Fuck me, a new brothel! The woman laughs.When her daughters get home the parrot says: Fuck me, 2 new prozzies! The girls laughs too.When the dad gets home the parrot says: Fuck me Pete, haven't seen you for weeks!"},
  {"title": "Do you want to know why the republicans won't impeach Trump?",
  "body": "Because they believe in carrying a baby to full term."},
  {"title": "What is a Karen called in Europe?",
  "body": "An American."},
  {"title": "Call me a racist if you want, but south of the border is a sea of violence, corruption and stupidity I wouldn't touch with a ten foot pole.",
  "body": "I just thank my lucky stars I live in Canada.Edit: Sorry."},
  {"title": "This shutdown is bad for everyone in the service industry, but it especially sucks for men",
  "body": "We're losing $1 for every $.79 women are losing"},
  {"title": "A boy asked his Bitcoin-investing dad...",
  "body": "...for $10.00 worth of Bitcoin currency.Dad: $9.67? What do you need $10.32 for?"},
  {"title": "The funniest /r/jokes has ever been",
  "body": ""}]